# CenterPointReference Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveElement..::..CenterPointReference Property
CurveElement Class See Also
---
Centerpoint reference of curve element. Curves such as circles, arcs, ellipses, and partial ellipses support this property.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public Reference CenterPointReference { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CenterPointReference As Reference
	Get
```

Visual C++
---
```text
public:
property Reference^ CenterPointReference {
	Reference^ get ();
}
```

# Remarks
Use this reference property when using the API to dimension between centerpoints of curves.
# See Also
CurveElement Class
Autodesk.Revit.DB Namespace